-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 20, 2020 at 08:36 PM
-- Server version: 10.1.37-MariaDB
-- PHP Version: 7.3.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `comments`
--
CREATE DATABASE IF NOT EXISTS `comments` DEFAULT CHARACTER SET utf8 COLLATE utf8_bin;
USE `comments`;

-- --------------------------------------------------------

--
-- Table structure for table `admin_details`
--

CREATE TABLE `admin_details` (
  `id` int(11) NOT NULL,
  `password` varchar(255) COLLATE utf8_bin NOT NULL,
  `role` varchar(12) COLLATE utf8_bin NOT NULL,
  `username` varchar(64) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `admin_details`
--

INSERT INTO `admin_details` (`id`, `password`, `role`, `username`) VALUES
(18, '$2a$10$zOT08W5t35fJ.6SR.F8YhOXUeaPY.XUQ8TjwMIvaOw0M/QRrCeMVG', 'ROLE_ADMIN', 'admin1'),
(20, '$2a$10$OdwtSlmFVJB1zAiS62Hcc.GKds1cGh7mEI.7AX/fNbiJXR0USWunm', 'ROLE_ADMIN', 'admin2'),
(58, '$2a$10$8WwZNug5dLGGbSlO3b1tZ.r4zv.Q83ZXLo9/H.mdmZMQQuWVDa31e', 'ROLE_ADMIN', 'nikola');

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE `comment` (
  `commentid` int(11) NOT NULL,
  `adminid` int(11) NOT NULL,
  `author` varchar(50) COLLATE utf8_bin NOT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `newsid` int(11) NOT NULL,
  `text` varchar(1000) COLLATE utf8_bin NOT NULL,
  `comment_state` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `comment`
--

INSERT INTO `comment` (`commentid`, `adminid`, `author`, `date`, `newsid`, `text`, `comment_state`) VALUES
(1, 10, 'Dobro, sta sada', '2020-01-09 16:59:45', 2, 'Moj omiljena pesma je Lapa si Pamela. Vise nema globalnih pojava koje spadaju u kategoriju boginja. Mada se niki jos prave na Cecu.', 0),
(2, 58, 'Plastika', '2020-01-11 00:26:14', 27, 'Време очаја време наде, једни руше а други драге. ', 1),
(3, 10, 'Plastika', '2020-01-09 18:00:32', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(4, 10, 'Plastika', '2020-01-09 18:01:38', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(5, 10, 'Plastika', '2020-01-09 18:03:22', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(6, 10, 'Plastika', '2020-01-09 18:03:28', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(8, 10, 'Plastika', '2020-01-09 18:12:13', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(9, 10, 'Plastika', '2020-01-09 18:34:12', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(10, 10, 'Plastika', '2020-01-09 18:34:26', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(11, 10, 'Plastika', '2020-01-09 18:34:41', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(12, 10, 'Plastika', '2020-01-09 18:37:47', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(13, 10, 'Plastika', '2020-01-09 18:38:26', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(14, 10, 'Plastika', '2020-01-09 18:39:39', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(15, 10, 'Plastika', '2020-01-09 18:39:52', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(16, 10, 'Plastika', '2020-01-09 18:40:32', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(17, 10, 'Plastika', '2020-01-09 18:42:51', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(18, 10, 'Plastika', '2020-01-09 18:44:26', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(19, 10, 'Plastika', '2020-01-09 18:44:27', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(20, 10, 'Plastika', '2020-01-09 18:44:57', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(21, 10, 'Plastika', '2020-01-09 18:58:49', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(22, 10, 'Plastika', '2020-01-09 18:59:19', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(23, 10, 'Plastika', '2020-01-09 19:13:02', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(24, 10, 'Plastika', '2020-01-09 19:13:04', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(25, 10, 'Plastika', '2020-01-09 19:13:05', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(26, 10, 'Plastika', '2020-01-09 19:13:14', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(27, 10, 'Plastika', '2020-01-09 19:19:56', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(28, 10, 'Plastika', '2020-01-09 19:20:13', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(29, 10, 'Plastika', '2020-01-09 19:21:08', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(30, 10, 'Plastika', '2020-01-09 19:21:13', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(31, 10, 'Plastika', '2020-01-09 19:35:47', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(32, 10, 'Plastika', '2020-01-09 19:36:25', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(33, 10, 'Plastika', '2020-01-09 19:37:26', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(34, 10, 'Plastika', '2020-01-09 19:38:09', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(35, 10, 'Plastika', '2020-01-09 19:38:11', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(36, 10, 'Plastika', '2020-01-09 19:41:21', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(37, 10, 'Plastika', '2020-01-09 19:41:22', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(38, 10, 'Plastika', '2020-01-09 19:41:36', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(39, 10, 'Plastika', '2020-01-09 19:42:32', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(40, 10, 'Plastika', '2020-01-09 19:43:52', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(41, 10, 'Plastika', '2020-01-09 19:44:02', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(42, 10, 'Plastika', '2020-01-09 19:47:08', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(43, 10, 'Plastika', '2020-01-09 19:47:10', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(44, 10, 'Plastika', '2020-01-09 19:47:15', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(45, 10, 'Plastika', '2020-01-09 19:50:54', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(46, 10, 'Plastika', '2020-01-09 19:50:56', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(47, 10, 'Plastika', '2020-01-09 19:51:27', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(48, 10, 'Plastika', '2020-01-09 23:33:27', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(49, 10, 'Plastika', '2020-01-09 23:33:33', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(50, 10, 'Plastika', '2020-01-10 00:05:41', 27, 'Време очаја време наде, једни руше а други драге. Америка није рад и зној, постоје Холивуд. бејебол и рокенрол. ', 0),
(55, 58, 'Pihtija ', '2020-01-10 23:20:54', 2, 'Trebalo da radi i latinična ćirilica. ', 0),
(59, 9, 'Pihtija ', '2020-01-10 23:33:20', 2, 'aaaaaaaaaaaaaaaaaaa', 1);

-- --------------------------------------------------------

--
-- Table structure for table `hibernate_sequence`
--

CREATE TABLE `hibernate_sequence` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `hibernate_sequence`
--

INSERT INTO `hibernate_sequence` (`next_val`) VALUES
(60),
(60);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin_details`
--
ALTER TABLE `admin_details`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`commentid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
